{"command.restartServer":"Restartovat server","extension.description":"Podpora lintování pro soubory Pythonu přes Flake8.","settings.args.description":"Argumenty předané Flake8 pro lintování souborů Pythonu. Každý argument by měl být v poli zadán jako samostatný řetězec. \n Příklady:  \n- `\"flake8.args\": [\"--rcfile=<file>\"]` \n - `\"flake8.args\": [\"--disable=C0111\", \"--max-line-length=120\"]`","settings.cwd.description":"Nastaví aktuální pracovní adresář, který se používá k lintování souborů Pythonu pomocí Flake8. Standardně používá kořenový adresář pracovního prostoru ${workspaceFolder}. Můžete ho nastavit na ${fileDirname}, aby se jako pracovní adresář pro Flake8 použila nadřazená složka souboru, který se lintuje.","settings.enabled.description":"Určuje, jestli se má povolit nebo zakázat lintování souborů Pythonu pomocí Flake8.","settings.ignorePatterns.description":"Nakonfigurujte [vzory glob](https://docs.python.org/3/library/fnmatch.html), jak je podporuje knihovna fnmatch Pythonu, abyste vyloučili soubory nebo složky z lintování pomocí Flake8.","settings.importStrategy.description":"Definuje, který binární soubor Flake8 se má použít k lintování souborů Pythonu. Pokud je nastaveno na useBundled, rozšíření použije binární soubor Flake8, který je dodáván s rozšířením. Pokud je nastaveno na fromEnvironment, rozšíření se pokusí použít binární soubor Flake8 a všechny závislosti, které jsou k dispozici v aktuálně vybraném prostředí. Poznámka: Pokud rozšíření nemůže ve vybraném prostředí najít platný binární soubor Flake8, použije se binární soubor Flake8 dodávaný s rozšířením. Pokud je toto nastavení nakonfigurováno na fromEnvironment, může být ignorováno také nastavení flake8.path.","settings.importStrategy.fromEnvironment.description":"Umožňuje použít Flake8 z vybraného prostředí. Pokud rozšíření nenajde platný binární soubor Flake8, použije místo toho zkompletovanou verzi Flake8 dodávanou s rozšířením.","settings.importStrategy.useBundled.description":"Vždy používat zkompletovanou verzi Flake8 dodanou s rozšířením.","settings.interpreter.description":"Cesta ke spustitelnému souboru Pythonu nebo k příkazu, který se použije ke spuštění serveru Flake8 a jakéhokoli podprocesu. Přijímá pole jednoho nebo více řetězců.  Když se nastaví na [], rozšíření použije cestu k vybranému interpretu Pythonu. Při předání příkazu by měl být každý argument zadán jako samostatný řetězec v poli.","settings.path.description":"Cesta nebo příkaz, které má rozšíření použít k lintování souborů Pythonu pomocí Flake8. Přijímá pole jednoho nebo více řetězců. Při předání příkazu by měl být každý argument zadán jako samostatný řetězec v poli. Pokud je nastaveno na [\"flake8\"], použije se verze Flake8 dostupná v proměnné prostředí PATH. Poznámka: Použití této možnosti může zpomalit lintování. \nPříklady: \n- `[\"~/global_env/flake8\"]` \n- `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"flake8\"]` \n `[\"flake8\"]`","settings.severity.description":"Mapování typů zpráv Flake8 na diagnostické úrovně závažnosti VS Code, jak se zobrazují v okně Problémy. Můžete ho také použít k přepsání konkrétních kódů chyb Flake8. \n Příklad:</br> {\"convention\": \"Information\", \"error\": \"Error\", \"fatal\": \"Error\", \"refactor\": \"Hint\", \"warning\": \"Warning\", \"W0611\": \"Error\", \"undefined-variable\": \"Warning\"}","settings.showNotifications.always.description":"Zobrazí všechna oznámení.","settings.showNotifications.description":"Určuje, kdy toto rozšíření zobrazuje oznámení.  Přípustné hodnoty jsou onError, onWarning, always a off.","settings.showNotifications.off.description":"Nikdy nezobrazí oznámení. Všechny chyby nebo upozornění jsou stále k dispozici v protokolech.","settings.showNotifications.onError.description":"Zobrazí oznámení o chybách.","settings.showNotifications.onWarning.description":"Zobrazí oznámení o chybách a upozorněních."}
