{"command.restartServer":"Sunucuyu Yeniden Başlatın","extension.description":"Flake8 kullanarak Python dosyaları için Linting desteği.","settings.args.description":"Python dosyalarının astarlanması için Flake8'e iletilen argümanlar. Her bağımsız değişken dizide ayrı bir dize olarak sağlanmalıdır. \n Örnekler:  \n- `\"flake8.args\": [\"--rcfile=<file>\"]` \n - `\"flake8.args\": [\"--disable=C0111\", \"--max-line-length=120\"]`","settings.cwd.description":"Flake8 ile Python dosyalarını lintlemek için kullanılan mevcut çalışma dizinini ayarlar. Varsayılan olarak, '${workspaceFolder}' çalışma alanının kök dizinini kullanır. Flake8'in çalışma dizini olarak astarlanan dosyanın ana klasörünü kullanmak için bunu `${fileDirname}` olarak ayarlayabilirsiniz.","settings.enabled.description":"Flake8 kullanarak Python dosyalarında linting özelliğinin etkinleştirilmesi veya devre dışı bırakılması.","settings.ignorePatterns.description":"Dosya veya klasörlerin Flake8 ile kaplanmasını engellemek için [glob desenlerini](https://docs.python.org/3/library/fnmatch.html) fnmatch Python kitaplığı tarafından desteklendiği şekilde yapılandırın.","settings.importStrategy.description":"Python dosyalarını lintlemek için hangi Flake8 ikili dosyasının kullanılacağını tanımlar. `useBundled` olarak ayarlandığında uzantı, uzantıyla birlikte gönderilen Flake8 ikili dosyasını kullanır. `fromEnvironment` olarak ayarlandığında uzantı, Flake8 ikili dosyasını ve o anda seçili ortamda bulunan tüm bağımlılıkları kullanmaya çalışacaktır. Not: Uzantı, seçilen ortamda geçerli bir Flake8 ikili dosyasını bulamazsa, uzantıyla birlikte gönderilen Flake8 ikili dosyasını kullanmaya geri döner. `flake8.path` ayarı, bu ayar `fromEnvironment` olarak ayarlandığında da göz ardı edilebilir.","settings.importStrategy.fromEnvironment.description":"Seçili ortamdan Flake8 kullanın. Uzantı geçerli bir Flake8 ikili dosyası bulamazsa, Flake8'in paketlenmiş sürümünü kullanmaya geri dönecektir.","settings.importStrategy.useBundled.description":"Her zaman uzantıyla birlikte gönderilen Flake8'in paket sürümünü kullanın.","settings.interpreter.description":"Python yürütülebilir dosyasının veya Flake8 sunucusunu ve herhangi bir alt işlemi başlatmak için kullanılacak komutun yolu. Tek veya birden çok dizenin dizisini kabul eder.  `[]` olarak ayarlandığında, uzantı seçili Python yorumlayıcısının yolunu kullanır. Komut geçiriliyorsa her bağımsız değişken dizide ayrı birer dize olarak sağlanmalıdır.","settings.path.description":"Flake8 ile Python dosyalarını lintlemek için uzantı tarafından kullanılacak yol veya komut. Tek veya birden çok dizenin dizisini kabul eder. Komut geçiriliyorsa her bağımsız değişken dizide ayrı birer dize olarak sağlanmalıdır. `[\"flake8\"]` olarak ayarlanırsa, `PATH` ortam değişkeninde mevcut olan Flake8 sürümünü kullanacaktır. Not: Bu seçeneğin kullanılması, linting işlemini yavaşlatabilir. \nÖrnekler: \n- `[\"~/global_env/flake8\"]` \n- `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"flake8\"]` \n `[\"flake8\"]`","settings.severity.description":"Flake8'in mesaj türlerinin, Sorunlar penceresinde görüntülendiği gibi VS Code'un teşhis önem düzeyleriyle eşleştirilmesi. Belirli Flake8 hata kodlarını geçersiz kılmak için de kullanabilirsiniz. \n Örnek:</br> `{\"convention\": \"Information\", \"error\": \"Error\", \"fatal\": \"Error\", \"refactor\": \"Hint\", \"warning\": \"Warning\", \"W0611\": \"Error\", \"undefined-variable\": \"Warning\"}`","settings.showNotifications.always.description":"Tüm bildirimleri göster.","settings.showNotifications.description":"Bildirimlerin bu uzantı tarafından ne zaman gösterileceğini kontrol eder.  Kabul edilen değerler: `onError`, `onWarning`, `always` ve `off`.","settings.showNotifications.off.description":"Hiçbir zaman bildirim görüntüleme. Tüm hatalar veya uyarılar günlüklerde kalır.","settings.showNotifications.onError.description":"Hatalar için bildirimleri göster.","settings.showNotifications.onWarning.description":"Hata ve uyarı bildirimlerini göster."}
