{"command.restartServer":"Redémarrer le serveur","extension.description":"Prise en charge du linting pour les fichiers Python à l'aide de Flake8.","settings.args.description":"Arguments passés à Flake8 pour le linting des fichiers Python. Chaque argument doit être fourni en tant que chaîne distincte dans le tableau. \n Exemples :  \n- `\"flake8.args\": [\"--rcfile=<file>\"]` \n - `\"flake8.args\": [\"--disable=C0111\", \"--max-line-length=120\"]`","settings.cwd.description":"Définit le répertoire de travail actuel utilisé pour linter des fichiers Python avec Flake8. Par défaut, il utilise le répertoire racine de l'espace de travail `${workspaceFolder}`. Vous pouvez la définir sur « ${fileDirname} » pour utiliser le dossier parent du fichier en cours de création comme répertoire de travail pour Flake8.","settings.enabled.description":"Indique s’il faut activer ou désactiver le linting des fichiers Python à l’aide de Flake8.","settings.ignorePatterns.description":"Configurez [modèles glob](https://docs.python.org/3/library/fnmatch.html) comme le fait la bibliothèque Python fnmatch pour exclure des fichiers ou des dossiers du linting avec Flake8.","settings.importStrategy.description":"Définit le binaire Flake8 à utiliser pour linter des fichiers Python. Lorsque la valeur est « useBundled », l’extension utilise le fichier binaire Flake8 fourni avec l’extension. Lorsqu’elle est définie sur « fromEnvironment », l’extension tente d’utiliser le binaire Flake8 et toutes les dépendances disponibles dans l’environnement actuellement sélectionné. Remarque : si l’extension ne parvient pas à trouver un binaire Flake8 valide dans l’environnement sélectionné, elle revient à l’utilisation du binaire Flake8 fourni avec l’extension. Le paramètre « flake8.path » peut également être ignoré lorsque ce paramètre est défini sur « fromEnvironment ».","settings.importStrategy.fromEnvironment.description":"Utilisez Flake8 à partir de l’environnement sélectionné. Si l’extension ne parvient pas à trouver un binaire Flake8 valide, elle utilise la version groupée de Flake8.","settings.importStrategy.useBundled.description":"Utilisez toujours la version groupée de Flake8 fournie avec l’extension.","settings.interpreter.description":"Chemin d’un exécutable Python ou d’une commande qui sera utilisée pour lancer le serveur Flake8 et tous les sous-processus. Accepte un tableau d’une ou plusieurs chaînes.  Quand la valeur est '[]', l’extension utilise le chemin de l’interpréteur Python sélectionné. Si vous passez une commande, chaque argument doit être fourni sous la forme d’une chaîne distincte dans le tableau.","settings.path.description":"Chemin d’accès ou commande à utiliser par l’extension pour linter des fichiers Python avec Flake8. Accepte un tableau d’une ou plusieurs chaînes. Si vous passez une commande, chaque argument doit être fourni sous la forme d’une chaîne distincte dans le tableau. S’il a la valeur « [\"flake8\"] », il utilise la version de Flake8 disponible dans la variable d’environnement « PATH ». Remarque : l’utilisation de cette option peut ralentir le linting. \nExemples : \n- `[\"~/global_env/flake8\"]` \n- `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"flake8\"]` \n `[\"flake8\"]`","settings.severity.description":"Mappage des types de messages de Flake8 aux niveaux de gravité de diagnostic de VS Code, comme indiqué dans la fenêtre Problèmes. Vous pouvez également l’utiliser pour remplacer des codes d’erreur Flake8 spécifiques. \n Exemple :</br> `{\"convention\": \"Information\", \"error\": \"Error\", \"fatal\": \"Error\", \"refactor\": \"Hint\", \"warning\": \"Warning\", \"W0611\": \"Error\", \"undefined-variable\": \"Warning\"}`","settings.showNotifications.always.description":"Afficher toutes les notifications.","settings.showNotifications.description":"Contrôle quand les notifications sont affichées par cette extension.  Les valeurs acceptées sont 'onError', 'onWarning', 'always' et 'off'.","settings.showNotifications.off.description":"Ne jamais afficher de notification. Les erreurs ou les avertissements sont toujours disponibles dans les journaux.","settings.showNotifications.onError.description":"Afficher les notifications pour les erreurs.","settings.showNotifications.onWarning.description":"Afficher les notifications d’erreurs et d’avertissements."}
