{"command.restartServer":"Ponowne uruchamianie serwera","extension.description":"Obsługa lintingu dla plików języka Python przy użyciu narzędzia Flake8.","settings.args.description":"Argumenty przekazane do narzędzia Flake8 na potrzeby lintingu plików języka Python. Każdy argument powinien być podany jako oddzielny ciąg w tablicy. \n Przykłady:  \n— „\"flake8.args\": [\"--rcfile=<file>\"]” \n — „\"flake8.args\": [\"--disable=C0111\", \"--max-line-length=120\"]”","settings.cwd.description":"Ustawia bieżący katalog roboczy używany do sprawdzania plików języka Python za pomocą narzędzia Flake8. Domyślnie używa katalogu głównego obszaru roboczego „${workspaceFolder}”. Możesz ustawić dla niego wartość „${fileDirname}”, aby użyć folderu nadrzędnego pliku, który jest sprawdzany, jako katalogu roboczego dla narzędzia Flake8.","settings.enabled.description":"Włączenie lub wyłączenie lintingu plików języka Python przy użyciu funkcji Flake8.","settings.ignorePatterns.description":"Skonfiguruj [wzorce globalne](https://docs.python.org/3/library/fnmatch.html) jako obsługiwane przez bibliotekę języka Python fnmatch, aby wykluczyć pliki lub foldery ze sprawdzania przez narzędzie Flake8.","settings.importStrategy.description":"Definiuje, który plik binarny narzędzia Flake8 ma być używany do sprawdzania plików języka Python. Po ustawieniu wartości „useBundled” rozszerzenie będzie używać pliku binarnego narzędzia Flake8 dostarczonego z rozszerzeniem. Po ustawieniu wartości „fromEnvironment” rozszerzenie podejmie próbę użycia pliku binarnego narzędzia Flake8 i wszystkich zależności dostępnych w obecnie wybranym środowisku. Uwaga: jeśli rozszerzenie nie może znaleźć prawidłowego pliku binarnego narzędzia Flake8 w wybranym środowisku, powróci ono do użycia pliku binarnego narzędzia Flake8 dostarczonego z rozszerzeniem. Ustawienie „flake8.path” może być również ignorowane, gdy to ustawienie jest ustawione na wartość „fromEnvironment”.","settings.importStrategy.fromEnvironment.description":"Użyj narzędzia Flake8 z wybranego środowiska. Jeśli rozszerzenie nie może znaleźć prawidłowego pliku binarnego narzędzia Flake8, powróci do używania powiązanej wersji narzędzia Flake8.","settings.importStrategy.useBundled.description":"Zawsze używaj dołączonej do pakietu wersji oprogramowania Flake8 dostarczanej z rozszerzeniem.","settings.interpreter.description":"Ścieżka do pliku wykonywalnego języka Python lub polecenia, które będzie używane do uruchamiania serwera narzędzia Flake8 i dowolnego podprocesu. Akceptuje tablicę jednego lub wielu ciągów.  Po ustawieniu wartości „[]” rozszerzenie użyje ścieżki do wybranego interpretera języka Python. W przypadku przekazywania polecenia każdy argument powinien być dostarczany jako oddzielny ciąg w tablicy.","settings.path.description":"Ścieżka lub polecenie, które ma być używane przez rozszerzenie do sprawdzania plików języka Python za pomocą narzędzia Flake8. Akceptuje tablicę jednego lub wielu ciągów. W przypadku przekazywania polecenia każdy argument powinien być dostarczany jako oddzielny ciąg w tablicy. Jeśli zostanie ustawiona wartość „[\"flake8\"]”, będzie używana wersja narzędzia Flake8 dostępna w zmiennej środowiskowej „PATH”. Uwaga: użycie tej opcji może spowolnić linting. \nPrzykłady: \n— „[\"~/global_env/flake8\"]” \n— „[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"flake8\"]” \n „[\"flake8\"]”","settings.severity.description":"Mapowanie typów komunikatów narzędzia Flake8 na poziomy ważności diagnostycznej programu VS Code, jak pokazano w oknie Problemy. Można go również użyć do zastąpienia określonych kodów błędów narzędzia Flake8. \n Przykład:</br> „{\"convention\": \"Information\", \"error\": \"Error\", \"fatal\": \"Error\", \"refactor\": \"Hint\", \"warning\": \"Warning\", \"W0611\": \"Error\", \"undefined-variable\": \"Warning\"}”","settings.showNotifications.always.description":"Pokaż wszystkie powiadomienia.","settings.showNotifications.description":"Określa, kiedy powiadomienia są wyświetlane przez to rozszerzenie.  Akceptowane wartości to „onError”, „onWarning”, „always” i „off”.","settings.showNotifications.off.description":"Nigdy nie wyświetlaj powiadomienia. Wszelkie błędy lub ostrzeżenia są nadal dostępne w dziennikach.","settings.showNotifications.onError.description":"Pokaż powiadomienia o błędach.","settings.showNotifications.onWarning.description":"Pokaż powiadomienia o błędach i ostrzeżeniach."}
